[{"title":"2018bilibili秋招算法策略岗笔试题","date":"2018-10-18T13:21:18.000Z","path":"2018/10/18/2018bilibili秋招算法策略岗笔试题/","text":"算法/策略岗位笔试题 2018年10月18日 3道编程题 1道应用问答题 1. `#include &lt;iostream&gt; using namespace std; int gold_num(int ans[][2],int m,int*ans_n){ int count=0; for(int i=0;i&lt;m;i++){ int a=ans_n[ans[i][0]-1]; int b=ans_n[ans[i][0]+1]; int c=ans_n[ans[i][1]-1]; if((a&gt;0) &amp;&amp; (b&gt;0) &amp;&amp; (c&gt;0) &amp;&amp; (a+b&gt;c) &amp;&amp; (a+c&gt;b) &amp;&amp; (b+c&gt;a)){ count+=1; } } return count; } int main(){ int n; cin &gt;&gt; n; int ans_n[n]; for (int i=0;i &lt; n;i++) { cin&gt;&gt;ans_n[i]; } int m; cin &gt;&gt; m; int ans[m][2]; for (int i=0;i&lt;m;i++) { for (int j=0;j &lt; 2;j++){ cin &gt;&gt; ans[i][j]; } } int num=gold_num(ans,m,ans_n); cout&lt;&lt;num&lt;&lt;endl; return 0; } ` 2. 3. `import sys from math import floor def is_number(x): try: int(x) return True except Exception as e: return False def reverseLinkedList(): nums=list(sys.stdin.readline().strip(&apos;,&apos;)) nums=[n for n in nums if is_number(n)] res=[] i=0 if len(nums)&lt;2: return list(nums) if len(nums)%2==0: while i&lt;floor(len(nums)/2): res.append(nums[i]) res.append(nums[len(nums)-1-i]) i+=1 else: while i&lt;floor(len(nums)/2): res.append(nums[i]) res.append(nums[len(nums)-1-i]) i+=1 res.append(nums[i]) return res res=reverseLinkedList() print(&apos;,&apos;.join(res))` 4.","link":"","permalink":"http://www.jianwu925.com/2018/10/18/2018bilibili秋招算法策略岗笔试题/","excerpt":"","tags":[{"name":"Programming","slug":"Programming","permalink":"http://www.jianwu925.com/tags/Programming/"}]},{"title":"2018秋招58笔试题","date":"2018-10-14T11:11:45.000Z","path":"2018/10/14/2018秋招58笔试题/","text":"2018秋招58同城-技术后端类笔试题(部分) 选择题1.Linux系统中，想要删除/58/jishu文件夹及其中的所有文件，应该使用（ ） A.rm /58/jishu B.rm -f 58/jishu C.rmdir -f /58/jishu D.rmdir /58/jishu 解析：选B,Linux中删除目录下的所有文件： (1)删除当前目录下的所有文件: rm -f * (2)删除指定目录下的文件:rm -f 指定目录* 2.系统使用LRU页面淘汰算法，假设为进程分配了4个页面的空间，该进程已访问的页面序列为3,4,2,3,1,7,2,9,2,4 若进程要访问的下一页的页号为6，应该淘汰的页号是（ ） A.7 B.1 C.2 D.4 解析：选A，最近最久未使用(LRU)的页面置换算法，LRU置换算法是选择最近最久未使用的页面予以淘汰。该算法赋予每个页面一个访问字段，用来记录一个页面自上次被访问以来所经历的时间t，当须淘汰一个页面时，选择现有页面中其t值最大的，LRU的实现（需要“堆栈”支持）。利用一个特殊的栈来保存当前使用的各个页面的页面号。每当进程访问某页面时，便将该页面的页面号从栈中移出，将它压入栈顶。因此，栈顶始终是最新被访问页面的编号，而栈底则是最近最久未使用页面的页面号。 3.春夏秋冬是老王的四个儿子，有一次有客人问起四兄弟的年龄，得到不同的回答。春说：“夏比秋小。”，夏说：“我比春小。”，秋说：“夏不是三哥。”，冬说：“我是大哥。”，憨厚的老王在旁补充道：“大儿子和三儿子撒谎呢，二儿子和小儿子说得对”。老王说的是实话，据此，按年龄从大到小的顺序，可以推断四兄弟的顺序依次为（ ） A.春、夏、秋、冬 B.春、夏、冬、秋 C.夏、春、秋、冬 D.夏、春、冬、秋 解析：选B， （1）先假设冬是大哥，则老大说的假话，由此矛盾，即冬不是老大，且冬应该为老三 （2）因为冬为老三，则秋说的话是正确的，秋应该为老二或者老四 （3）假设春为老大，则春说的应该是假话，则夏&gt;秋，夏说的真话，夏&lt;春，符合题意 因此最终：春&gt;夏&gt;冬&gt;秋 4.计算学校中的所有学生的重名的次数，使用以下哪种数据结构最好？（ ） A. 堆 B. 哈希表 C. 数组 D. 链表 解析：选B，相同元素哈希后的结果一致，因此选哈希表。 5.前序遍历二叉树的结果为1,2,3,4,5。二叉树的有多少种可能的形状（ ） A. 41 B. 42 C. 43 D. 44 问答题 有n+1个不同的整数（a1,a2,…,an,m），假设有一个乱序的整数序列，其中a1,a2,…,an分别出现了两次，m出现一次，需要找出出现一次的m，给出查找的思路，要求时间和空间复杂度越小越好。 程序员小王，小李在一起讨论公司系统订单表的设计方案，但就订单的ID的生成方式产生了不同的想法，小王说订单ID是主键，可以通过数据库的数值型自增字段去实现，这样很简单，而小李却有不同的想法，他说，如果使用数据库的自增字段去实现，那么外部人员就很容易通过订单ID的变化去推测公司一天有多少订单，造成商业机密的泄露，所以应该使用UUID的方法生成唯一的字符串ID。对此你有什么好的想法，请阐述方案和理由。 在一个含有16核的电脑中处理，使用两个进程处理m–操作，各执行100次,最终的m取值范围是什么？ 编程题1.返回已排序数组中的第一个大于或等于给定数字的元素的位置。 例如数组[1，2，3，5，9]，给定数字3，则返回2；给定数字4，则返回3，如给出的数字大于数组中的最大值，则返回数组的长度。（java/C++/C实现） 两个集合中存放的是一个数字区间，第一个集合存放了两个数字区间，第二个集合存放了一个区间，求出这两个区间的数学交集部分，例如{[1,7],[9,12]},{[6，10]}，返回的结果为{[6,7],[9,10]}。(java/C++/C实现) 应用题每年的十一期间，都有来自全球各地的游客来北京旅游，假设在北京所有的车站出入口都安装了监控的机器，每名旅客通过时，可以获得旅客的身高数据，165代表身高1.65米。预计每天的旅客人数在1亿多，现在需要统计以下信息。 1.每天所有的旅客的平均身高？（假设不能使用64位long，只能使用32位int的条件下，直接计算所有人数的身高和会溢出）。 2.身高较高的前20%的滤旅客身高是多少？ 请给出设计方案。","link":"","permalink":"http://www.jianwu925.com/2018/10/14/2018秋招58笔试题/","excerpt":"","tags":[{"name":"DataMining","slug":"DataMining","permalink":"http://www.jianwu925.com/tags/DataMining/"}]},{"title":"17个Python实用技巧","date":"2018-09-21T12:21:41.000Z","path":"2018/09/21/17个Python实用技巧/","text":"Python中的17个重要的“高效且实用的技巧” 交换变量 将列表合成一个字符串 查找列表中出现频率最高的值 检查两个字符串是不是相同字母不同顺序组成的 反转字符串 反转列表 转置二维数组 链式比较 链式函数调用 复制列表 字典的get方法 通过key排序字典 For else 转换列表为逗号分隔符格式 合并字典 列表中最小和最大的索引 移除列表中的重复元素 交换变量 将列表合成一个字符串 查找列表中出现频率最高的值 检查两个字符串是不是相同字母不同顺序组成的 反转字符串 反转列表 转置二维数组 链式比较 链式函数调用 复制列表 字典的get方法 通过key排序字典 For else 转换列表为逗号分隔符格式 合并字典 列表中最小和最大的索引 移除列表中的重复元素 参考： https://mp.weixin.qq.com/s?__biz=MzIwNDA1OTM4NQ==&amp;mid=2649542182&amp;idx=1&amp;sn=74e82370aec279f78fd56538ed681f6a&amp;chksm=8edd89b0b9aa00a607bef23dfe230c15178234fb53c146c534c42af06d272117c48052d2cdb6&amp;scene=0#rd","link":"","permalink":"http://www.jianwu925.com/2018/09/21/17个Python实用技巧/","excerpt":"Python中的17个重要的“高效且实用的技巧” 交换变量 将列表合成一个字符串 查找列表中出现频率最高的值 检查两个字符串是不是相同字母不同顺序组成的 反转字符串 反转列表 转置二维数组 链式比较 链式函数调用 复制列表 字典的get方法 通过key排序字典 For else 转换列表为逗号分隔符格式 合并字典 列表中最小和最大的索引 移除列表中的重复元素","tags":[{"name":"Programming","slug":"Programming","permalink":"http://www.jianwu925.com/tags/Programming/"}]},{"title":"数学建模心路历程","date":"2018-09-19T11:25:26.000Z","path":"2018/09/19/数学建模心路历程/","text":"今天中午一直睡觉到下午六点半，醒的那一刻才感觉自己慢慢复活了。刚过去的100小时（2018年9月15日8点—2018年9月19日12点），真的是一段难忘和煎熬的过程。 研究生数学建模的过程是对身心和体力的极大消耗。平均每天睡眠时间4个小时，在寝室待了四天多，每天除了正常的吃饭时间去北广食堂吃饭以外，其他时间一直坐在电脑面前，编程，向算法过程，解题思路，数据处理。这是煎熬和难忘的100小时。 数学建模的过程不易，不管结果如何，自己已经对拥有这段和室友一起奋战做建模的的经理很满意了，自己能坚持下来，身心俱疲。感谢室友的团结协作，室友很厉害，每个人都把自己的能力展现出来，感谢两位室友的并肩战斗。 下面是具体的经历： 2018年9月15日8点：开始选题，https://cpipc.chinadegrees.cn/在经过1个小时审完A,B,C,D,E,F题后，对每道题的认知： A题：运动员跳水过程的物理学建模，偏向于物理学和数学分析，感觉需要用到力学知识，微风方程等。 B题：光传送网建模与价值评估，需要物理学和通信学科知识，也感觉不是我们所擅长的。 C题：恐怖袭击事件的量化分析建模，11万行数据，135个属性变量，涉及到对恐怖袭击事件的危害程度进行综合量化评价，和对未确立作案者的恐怖袭击事件找出可能的作案嫌疑组织或个人，以及对恐怖袭击事件的时空特性、蔓延特性、级别等进行挖掘和建模，以及最后的开放性题，如何再从数据中挖掘出什么信息和建模。 D题：基于卫星高度计海面高度异常资料获取潮汐调和常数方法及应用，涉及到卫星通信，天体物理信息，海潮信息，地理信息等， E：无人机和抗干扰雷达之间的对抗，如何相互干扰，如何对抗 F：机场新增卫星厅对中转旅客影响的评估方法，感觉是运筹学方面的优化建模和评估。 9月15日：开题后，经过一半小时的时间，把六个题全部看了一遍之后，大家一直觉得C题适合。考虑到适合计算机专业，做数据挖掘类的建模，利用机器学习技术解决，数量大，也适合我这种做数据的人。选完题后，就进入正式建模过程，我负责主要处理数据和代码编写，嘉伟负责收集文献，小郭负责论文的编写，三人正是进入建模的鏖战中。—-第一天2点40睡觉，睡眠5个半小时。 9月16日：针对第一问，考虑了层次分析法，模糊动态加权评分法，最后考虑使用PCA主成分分析法确立变量的权重。对数据进行预处理，删掉缺失比例过高的字段，删除缺失比例过高的行，在筛选变量进行数据降维和主成分分析，确立变量的权重，最后计算评分，得到每个恐怖袭击事件的危害程度系数得分。到晚上才初步把第一问做出来，感觉很难对变量进行筛选，找不到筛选的方法，人为主观的筛选方法，放在数学建模这，感觉不严谨。—–第二天睡觉时间3点半左右，睡眠4个多小时。 9月17日：赶紧进入第二问，主要是解决对未知作案者的事件确立作案者，以及排出全球前5的恐怖组织和个人，对典型事件确立时间作案者，主要思路：利用第一问的对每个时间的危害性系数，计算每个组织的F值总分，选出前5个，对数据进行降维，然后再利用DBSCAN进行聚类，确立作案者。—睡觉时间：4点左右，睡眠4个小时。 9月18日：下午勉强做完第二问，进入第三问，研究近三年来恐怖袭击事件发生的主要原因、时空特性、蔓延特性、级别分布等规律，进而分析研判下一年全球或某些重点地区的反恐态势。主要进行了对作案动机进行词频统计分析，建立了南亚地区的恐怖袭击事件发生次数的ARMA时序模型，以及空间蔓延模型，莫兰指数等，画了很多关于恐怖袭击的分布态势图。—-熬夜通宵 9月19日：赶紧利用Weka软件，对数据进行关联规则的挖掘，找出一些规则，以及做了中国国内的恐怖袭击状况分析。11点45分，把论文MD5码提交了以后。才算是100小时建模鏖战结束。！！！！ 感受： （1）连续建模，身体很累，感觉全身冒汗，出油，蓬头垢面的，很是煎熬，但还是坚持下来了。 (2)问题很多,查阅大量的文献，找寻方法 （3）数据量很大，处理数据略慢， （4）室友很给力，一起奋战，熬夜，最后通宵，坚持到最后一刻 （5）珍惜身体，加强锻炼，有健康的体魄，才能不断地“肝” 做完建模，美美的睡了一下午，保养一下身体。收拾东西，清理桌面，重新回归到正常的学习生活中，从数学建模的地狱中走出来了。不管结果如何，自己欣然接受，感谢团队三人的不懈付出。过程难忘，第一次建模，也是最后一次建模，仿佛已经听到宣讲会的声音了，加油！！！！","link":"","permalink":"http://www.jianwu925.com/2018/09/19/数学建模心路历程/","excerpt":"今天中午一直睡觉到下午六点半，醒的那一刻才感觉自己慢慢复活了。刚过去的100小时（2018年9月15日8点—2018年9月19日12点），真的是一段难忘和煎熬的过程。 研究生数学建模的过程是对身心和体力的极大消耗。平均每天睡眠时间4个小时，在寝室待了四天多，每天除了正常的吃饭时间去北广食堂吃饭以外，其他时间一直坐在电脑面前，编程，向算法过程，解题思路，数据处理。这是煎熬和难忘的100小时。","tags":[{"name":"Note","slug":"Note","permalink":"http://www.jianwu925.com/tags/Note/"}]},{"title":"reading first","date":"2018-09-02T13:26:55.000Z","path":"2018/09/02/reading-first/","text":"看过的书籍 《钢铁是怎样炼成的》 《巴黎圣母院》 《我的大学》 《骆驼祥子 看过的杂志 读者 青年文摘 意林 看过的书籍《钢铁是怎样炼成的》作者 奥斯特洛夫斯基小说通过记叙保尔·柯察金的成长道路告诉人们，一个人只有在革命的艰难困苦中战胜敌人也战胜自己，只有在把自己的追求和祖国、人民的利益联系在一起的时候，才会创造出奇迹，才会成长为钢铁战士。 《巴黎圣母院》作者 雨果 《巴黎圣母院》是法国文学家维克多·雨果创作的长篇小说，《巴黎圣母院》以离奇和对比手法写了一个发生在15世纪法国的故事：巴黎圣母院副主教克罗德道貌岸然、蛇蝎心肠，先爱后恨，迫害吉ト赛女郎埃斯梅拉达。面目丑陋、心地善良的敲钟人卡西莫多为救女郎舍身。小说揭露了宗教的虚伪，宣告禁欲主义的破产，歌颂了下层劳动人民的善良、友爱、舍己为人，反映了雨果的人道主义思想。 《我的大学》作者 高尔基《我的大学》是前苏联作家马克西姆·高尔基创作的自传体小说《人生三部曲》中的最后一部。其余两部为《童年》、《在人间》。该书中作者描写了他青年时代的生活经历。从这个被真实记述下来的过程中，可以看出青少年时代的高尔基对小市民习气的深恶痛绝，对自由的热烈追求，对美好生活的强烈向往。 《骆驼祥子》作者 老舍 《骆驼祥子》是人民艺术家——老舍（舒庆春）所著的长篇小说，描述了20世纪20年代军阀混战时期人力车夫的悲惨命运。祥子是旧社会劳苦大众的代表人物。 看过的杂志《读者》《读者》，原名《读者文摘》，是由读者出版传媒股份有限公司主办的中文版半月刊物。《读者》杂志发掘人性中的真、善、美，体现人文关怀。《读者》在刊物内容及形式方面与时俱进，追求高品位、高质量，力求精品，并以其形式和内容的丰富性及多样性，赢得了各个年龄段和不同阶层读者的喜爱与拥护。发行量稳居中国期刊排名第一，亚洲期刊排名第一，世界综合性期刊排名第四。被誉为“中国人的心灵读本”、“中国期刊第一品牌”。 青年文摘《青年文摘》由共青团中央主管、中国青年出版社主办，创刊于1981年1月，自2000年起改为半月刊，是中国发行量最大的青年杂志，单期发行145-150万册。 《青年文摘》是一本面向全国、以青少年为核心读者群的文摘类综合刊物，刊物集萃来自报纸、期刊、图书等大众媒体的名篇佳作，旨在为青少年打造一个丰富生动、健康向上的精神空间。 意林 《意林》，原名《春风》，是由中共长春市委宣传部主管，长春市文学艺术界联合会主办的中文版半月刊杂志。2003年4月，《春风·意林》开始筹备，8月正式创刊；2004年6月，经新闻出版署批准，从第7期正式改名为《意林》；2005年5月由月刊改为半月刊。","link":"","permalink":"http://www.jianwu925.com/2018/09/02/reading-first/","excerpt":"看过的书籍 《钢铁是怎样炼成的》 《巴黎圣母院》 《我的大学》 《骆驼祥子 看过的杂志 读者 青年文摘 意林","tags":[{"name":"Reading","slug":"Reading","permalink":"http://www.jianwu925.com/tags/Reading/"}]},{"title":"机器学习认知","date":"2018-09-02T13:13:31.000Z","path":"2018/09/02/机器学习认知/","text":"机器学习概念 机器学习总框架 深度学习框架 机器学习概念机器学习(Machine Learning, ML)是一门多领域交叉学科，涉及概率论、统计学、逼近论、凸分析、算法复杂度理论等多门学科。专门研究计算机怎样模拟或实现人类的学习行为，以获取新的知识或技能，重新组织已有的知识结构使之不断改善自身的性能。 机器学习总框架以及附上一张人工智能入坑的知识结构图 深度学习框架","link":"","permalink":"http://www.jianwu925.com/2018/09/02/机器学习认知/","excerpt":"机器学习概念 机器学习总框架 深度学习框架","tags":[{"name":"MachineLearning","slug":"MachineLearning","permalink":"http://www.jianwu925.com/tags/MachineLearning/"}]},{"title":"数据挖掘认知","date":"2018-09-02T12:55:33.000Z","path":"2018/09/02/数据挖掘认知/","text":"数据挖掘含义 数据挖掘一般过程 数据挖掘分类 数据挖掘相关实用技术 数据挖掘含义 数据挖掘就是从大量的、不完全的、有噪声的、模糊的、随机的数据中，提取隐含在其中的、人们事先不知道的但又是潜在有用的信息和知识的过程。数据挖掘的任务是从数据集中发现模式，可以发现的模式有很多种，按功能可以分为两大类：预测性(Predictive)模式和描述性(Descriptive)模式。在应用中往往根据模式的实际作用细分为以下几种：分类，回归，聚类、异常值检测、降维，关联规则，频繁模式，序列模式，时间序列，描述和可视化等。 数据挖掘一般过程数据挖掘的一般过程如下图所示： 数据挖掘分类挖掘任务分，可分为分类或预测模型发现、数据总结、聚类、关联规则发现、序列模式发现、依赖关系或依赖模型发现、异常和趋势发现等等；根据挖掘对象分，有关系数据库、面向对象数据库、空间数据库、时态数据库、文本数据源、多媒体数据库、异质数据库、遗产数据库以及环球网Web；根据挖掘方法分，可粗分为：机器学习方法、统计方法、神经网络方法和数据库方法。机器学习中，可细分为：归纳学习方法(决策树、规则归纳等)、基于范例学习、遗传算法等。统计方法中，可细分为：回归分析(多元回归、自回归等)、判别分析(贝叶斯判别、费歇尔判别、非参数判别等)、聚类分析(系统聚类、动态聚类等)、探索性分析(主元分析法、相关分析法等)等。神经网络方法中，可细分为：前向神经网络(BP算法等)、自组织神经网络(自组织特征映射、竞争学习等)等。数据库方法主要是多维数据分析或OLAP方法，另外还有面向属性的归纳方法等等。 数据挖掘相关实用技术统计技术，关联规则，基于历史的分析，遗传算法，聚集检测，连接分析，决策树，神经网络，粗糙集，模糊集，回归分析，差别分析，概念描述等十三种常用的数据挖掘的技术。 参考资料： https://blog.csdn.net/evillist/article/details/73275188","link":"","permalink":"http://www.jianwu925.com/2018/09/02/数据挖掘认知/","excerpt":"数据挖掘含义 数据挖掘一般过程 数据挖掘分类 数据挖掘相关实用技术","tags":[{"name":"DataMining","slug":"DataMining","permalink":"http://www.jianwu925.com/tags/DataMining/"}]},{"title":"Python 数据分析trick","date":"2018-09-01T14:07:07.000Z","path":"2018/09/01/Python-数据分析trick/","text":"统计每行、每列的缺失情况 画roc_auc图 画pr_auc图 画k_fold_roc图 画k_fold_pr图 统计每行、每列的缺失情况def miss_check(df): isnull_df=df.isnull() row_miss_series=isnull_df.sum(axis=1) row_miss_series=isnull_df.sum(axis=0) return row_miss_series,row_miss_series","link":"","permalink":"http://www.jianwu925.com/2018/09/01/Python-数据分析trick/","excerpt":"统计每行、每列的缺失情况 画roc_auc图 画pr_auc图 画k_fold_roc图 画k_fold_pr图","tags":[{"name":"Programming","slug":"Programming","permalink":"http://www.jianwu925.com/tags/Programming/"}]},{"title":"高中感悟","date":"2018-08-29T11:47:34.000Z","path":"2018/08/29/高中感悟/","text":"———-高中感悟————– 日日行不怕千万里，常常做不怕千万事 相信天道酬勤 人无我有，人有我优，人优我精，人精我创 告诫：人间至纯的东西永远胜过人间至伪的东西。 —–《风雨丽人》 日日行不怕千万里，常常做不怕千万事圆梦与原梦。 主动性与计划性。 不能及时找到和解决当天发现的问题。 不能及时纠正错误 越挫越勇。 以饱满的热情，得到饱和的结果。 统筹安排合理计划，分批次强攻，分散复习。 每道题只是披着不同款式的衣服，而里面的模型是一样的。我们需要透过现象看到本质。 每天巩固，每天掌握，每天消化，这样才能达到吸收的效果。 相信天道酬勤每天一根救命稻草，考试时形成一颗参天的大树，。我们没有挺不住的权利。即使是现在也不能让廉价的快乐毁了自己的一生。相信自己一定会成功。 克服所谓的“高原现象”，发现自己的偏点和弱点，处理作业的质和量。 以方法为纬度贯穿各种题型，注重训练时的竞技状态。笔记价更高。知识的备忘录。 调整学习和生活方式。时刻保持“永争第一”的态度。惜时如金，学会记账。 严于律己，治学严谨，必能成才。效率取决于激情。 1954年罗杰班尼斯首先开创了四分钟跑完一英里的记录。同一年竟有300名运动元达到了这一极限。高考既有万米长跑的耐力，又要有百米冲刺的速度。 人无我有，人有我优，人优我精，人精我创相信奋斗的力量，奋斗让自己变得更有魅力。机会是留给有准备的人的，不要让偶然变成必然。从失败中积累经验。 ——–俞敏洪 这世界从来就没有过公平，所谓的公平只是对少数成功的人而言的。—-俞敏洪你的行为透露出你个人的智慧。能力与智慧能让人忽视你的外在形象。 自我的感悟：做一个实实在在的人，不要让自己活在虚幻之中，用实际践行自己。 告诫：人间至纯的东西永远胜过人间至伪的东西。 —–《风雨丽人》 2013年12月2日星期一","link":"","permalink":"http://www.jianwu925.com/2018/08/29/高中感悟/","excerpt":"———-高中感悟————– 日日行不怕千万里，常常做不怕千万事 相信天道酬勤 人无我有，人有我优，人优我精，人精我创 告诫：人间至纯的东西永远胜过人间至伪的东西。 —–《风雨丽人》","tags":[{"name":"Note","slug":"Note","permalink":"http://www.jianwu925.com/tags/Note/"}]},{"title":"经验感悟","date":"2018-08-29T11:28:51.000Z","path":"2018/08/29/经验感悟/","text":"大学是个体之间富有生命的交往。 没有不好的课程，只有不好的老师。 事物本身不影响人，人们只受对事物看法的影响。 你不主动,我不主动,然后我们的关系就慢慢消失了,人与人之间没有谁离不开谁,只有谁不珍惜谁,一个转身,二个世界。 一生之中有一个爱你,疼你,牵挂你的人,这就是幸福。万人追不如一人疼,万人宠不如一人懂。世界上不是所有人都可以掏心掏肺互诉衷肠。路过的都是缘,擦肩而过的都是客。 世界上唯一可以不劳而获的就是贫穷，唯一可以无中生有的是梦想。 别沮丧，生活就像心电图，一帆风顺就证明你挂了。 没有人可以做你的双拐，你必须学会独立去闯荡；犯错的时候，要勇于承担，畏缩虽是一种自保，但当他人把你看扁的时候，你就彻底淡出了成功的机遇之外。再困难，咬咬牙，总会过去的；再犯错，不孤独，一切还可以重来。人生没有痛苦，就会不堪一击。正是由于有痛苦，所以成功才那么美丽动人；由于有灾患，所以欢乐才那么令人喜悦；由于有饥饿，所有佳肴才让人觉得那么甜蜜。正是由于有痛苦的存在，才能激发我们人生的气力，使我们的意志更加坚强。 对人来说，身体只是生命的工具，是我们活动与行为的工具，是完成人生事业的工具，而精神才是是生命的主宰，生命的本质是真正体现生命的价值的。人真正的富有是精神的富有，真正的力量是精神的力量，人的价值是由他的精神力量和精神深度决定的。人身体的潜能是有限的，而人心理的潜能是无限的。 很多人自以为是屌丝而自卑，殊不知这个世界上其实最牛的那群人绝大部分属于矮富丑，高富帅只不过是少数存在的传说，真正有些成就的人帅的真不多，所以不是长相和高度的问题，关键还是钱的问题，不是父母遗传的问题，是自己的机遇与努力的问题!走到最后还是屌丝不完全是老天的错，别把什么都怪给别人. 《读者文摘-心灵篇》给心灵通通风，读书笔记：贫穷让我们在泪光中学会微笑，在痛苦中感受快乐。","link":"","permalink":"http://www.jianwu925.com/2018/08/29/经验感悟/","excerpt":"大学是个体之间富有生命的交往。 没有不好的课程，只有不好的老师。 事物本身不影响人，人们只受对事物看法的影响。","tags":[{"name":"Note","slug":"Note","permalink":"http://www.jianwu925.com/tags/Note/"}]},{"title":"彷徨时瞅一眼","date":"2018-08-28T13:05:04.000Z","path":"2018/08/28/彷徨时瞅一眼/","text":"引导语：人生路上不如意十常八九，遇到挫折时常常情绪低落，所以，当你举棋不定时，不防问问自己，这么做，将来会后悔吗？用今天的努力让明天没有遗憾!人生格言:思路决定出路,人生在于奋斗。 成功的人，就是那种能用别人扔向他的石头来铺设路基的人。 批评你的人是你今天的敌人，明天的朋友；吹捧你的人是你今天的朋友，明天的敌人。 Nothing is impossible、只要选择了目标，不要再想太远，每天脚踏实地，风雨兼程。生命不息，战斗不止。 你和你的朋友会一起在将来打造一个可能很辉煌的事业。很好听是吗？记住，你们都要努力。 很多事情当你再回忆时会发现其实没什么。所以，不管当时你多么生气都告诉自己不必这样，你会发现其实真的不必。 别怕丢人，追求丢人是一种成功的尝试，至于为此笑话你的人，你可以把他们从你将来人生对手的名单中排除了，你也要为每一位上台唱歌的人鼓掌。 人生在世，需要不断地为心灵除尘，自省、自责、自悟、自重…… 永远不要对可能是坏事的事好奇，否则可能要了你的命。永远不要在痛苦的时候做决定，否则你以后一定会后悔。 别为你自己和别人下定论，你所看到听到的可能只是一面。 如果周围有人嫉妒你，那么你可以把他从你的竞争者之列排除了。 很多事情别人通知你了，要说谢谢，没有通知你，不要责怪，因为那些事你其实应该自己弄清楚。 一个人最大的痛苦，莫过于被圈在自己设定的圈子里出不来。就像一只蚕，丝吐的越多，对自己捆绑得越紧，直到最后完全把自己包上，想出也出不来。 善良是一种智慧，是一种远见，一种自信，一种精神力量，是一种文化，一种快乐。 一个人的脚步再大，也永远无法丈量完脚下的道路。人生有限，道路无限，要想在有限的生命中多走一程，就时刻别停下脚步，别浪费分秒时间。 遇到再大困难的时候，不要惊慌，千万要学会冷静；不要去想着求别人，以前有家人帮你，现在需要你一个人面对挑战，从绝望中寻找希望，人生终将辉煌。 学会说谢谢，但谢谢并不是随便敷衍，是对别人帮助的肯定和回报；更要学会说对不起，但对不起不是借口，是对自己过错的弥补和内疚。 处事不必求功，无过便是功；为人不必感德，无怨便是德。 有时你的快乐是你的微笑之源，但是有时候你的微笑却可能是你的快乐之源。 不论男人还是女人，如果还把容貌当作重要的东西而过分重视的话，可能不会吃亏，但是早晚会吃亏、可能，很可能。 放假的时候，要么留在家里多陪陪父母，帮他们做点事，远走高飞的你能像以前天天守在他们身旁的时间已不多；要么多去社会中体验生活，因为你不但要懂得生活，还要学会如何去生活。 心烦意乱或者无聊闲着的时候，多到图书馆去泡泡，书中有现实中难得的纯明和清静；多看些书，生活会渐渐少一些迷茫，多一些追求。 一个人如果心中时刻能够想着别人，别人也一定会时刻想着你。多替别人着想，就等于给自己铺设一条道路。你付出的越多，你得到的也会越多，这就叫做感情投资或感情积累。 你可以输给任何人，但不能输给自己。 经常给家里打个电话，即使嘴上都说不想对方，其实内心早已情动于中；有了女（男）朋友，也不能忘了爹和娘。 多笑笑，会慢慢让自己真的快乐起来。 好好利用公开场合锻炼、展示自我，哪怕只是一次课堂上的发言，别怕尴尬，更别怕丢人，也不要笑话在公众面前丢脸的人。 小人的眼睛里没有君子，君子的眼睛却可以识破小人。 屈原说：“路漫漫其修远兮，吾将上下而求索。”这种精神可贵，但在现实之中却很少有人能这样执着了。如果有人能够做到，他一定会是最成功的人。 永远别渴望做个任何人都不得罪的人，有人反对有人支持然后自己做出决定是精彩的人生。 一个生命完结，另一个生命诞生，世界就是在这种循环中得到永恒。用不着为死去的过于悲哀，也用不着为新生的过分高兴。生命都是一种相同的过程，关键在于能否使它辉煌。如果一个人能活得无愧无悔，坦坦荡荡，虽未轰轰烈烈，但这仍可算作是伟大的一生。 后悔是一种耗费精神的情绪、后悔是比损失更大的损失，比错误更大的错误、所以不要后悔。 你的确要学的有心计，但是记住，永远记住，在社会上要胜利的唯一的方法永远只是一个，那就是实力，永远不用怀疑。 人生百态，不要对新的看不惯的东西生气，无所谓的。 我们确实活得艰难，一要承受种种外部的压力，更要面对自己内心的困惑。在苦苦挣扎中，如果有人向你投以理解的目光，你会感到一种生命的暖意，或许仅有短暂的一瞥，就足以使我感奋不已，所以我们要学会感激。 冷静，有大事时，能安静并能快速想出办法的人，很厉害。 社会充满竞争，赢得竞争靠的是自己的实力。 一种对工作和学习的冲击力及持久力会让你有特殊的魅力和个人实力。 父母给我们生命，生活给我们智慧。智慧产生于社会实践，这是千真万确的真理。因此，不仅要珍惜生命，珍视生活，更要重视社会实践。不经历风雨就无法见到彩虹，没有实践就无法得到智慧。 积水成渊，积土成山。不积跬步无以致千里，做事万不可心急，必须从一点一滴做起，必须从每一件小事做起。现在的人常是小事不做，大事做不来，到头来空活一场，空耗一生。 水涨船高，勿怕他人强于己。水落石出，别羡乌云压枝低。 你可以选择坚持，也可以选择放弃。没有对错。我是说对爱情来说，但是重要的是坚持你的选择。 如果老是去琢磨哪些人你讨厌，哪些人与你志趣相投，那么你就大错了，要想着如何让别人接纳你，而不是你能接受什么样的人。 对陌生人，或者把对方当做一张白纸，或者把对方当你的朋友，总之别当做敌人，即使你听到再多的关于他（她）的不好的传闻。 爱你的人，不管你接不接受，你都应该感谢对方，这是对他们的尊重。 坚持在背后说别人好话，别担心这好话传不到当事人耳朵里，有人在你面前说某人坏话时，你只微笑。 抽时间出来锻炼身体。 不管现在你对未来多困惑，多迷茫，都不要忘了树立一个目标。一个人过去或现在的情况并不重要，将来想要获得什么成就才最重要。除非你对未来有理想，否则做不出什么大事来。 不要把过去的事全让人知道，尊敬不喜欢你的人。 成大事的方法多种多样 ，别不接受你看不惯的方法。 一切以健康为中心,遇事潇洒一点，看世事糊涂一点。 气不鼓不能前进，气太足可能爆胎。 三个忘记：忘记年龄，忘记过去，忘记恩怨。 乐观的人看见问题后面的机会，悲观的人只看见机会后面的问题，机会是从来不会主动敲响你的门，无论你等待多少年。它也只会如一阵风一样拂面而过，需要你的反应能力和追随速度。朝着一个目标前进，尽量使用你的潜能，才华横溢的你会发现机会的存在。风虽然没有颜色，可是拂过之后却是绿意一片。 后悔是一种耗费精神的情绪，后悔是比损失更大的损失，比错误更大的错误，所以不要后悔。 人生唯一不会落空的等待是注定的死亡，世间唯一保持恒久不变的就是变化。 最难战胜的敌人 ，是自己；最可怕的敌人，是朋友；最防不胜防的敌人，是欲望；最迷惑人的敌人，是感情。 生活是一种经历，也是一种体验；生活是一种感受，也是一种积累。生活没有答案，生活不需要答案。当生活即将不属于你时，你才会发现:生活仅仅是一个过程，而这个过程无论多么复杂，最终结局都是一样的。生活注重的是过程，而不是结局。 奋斗人生的诀窍就是经营自己的长处。经营自己的长处能给你的人生增值。经营自己的短处必然使你的人生贬值。 有所得是低级快乐，无所求是高级快乐。 一个会讲话的人，不是记得别人说过话的人，而是能说些让人记得的话。 是非窝里，人用口，我用耳；热闹场中，人向前，我落后。 还能冲动，表示你还对生活有激情，总是冲动，表示你还不懂生活。 从来没有得罪过人的人，注定也不可能与人深交。太多的平和与从容，反而丧失了做人的激情与率真。 当不幸降临在他人头上时，他们往往都能像智者一样劝慰别人；而当同样的不幸降临自己身上时，人往往很难同样地开导自己。 有些缺陷放在别人身上看起来微不足道，不值得一提；但是，这些缺陷若放在自己身上，则很难轻松看待，甚至一生都不能释怀。 自己说过、做过伤害别人心灵的事，有可能转眼间就忘得一干二净；而别人说过或做过的伤害自己的事往往一辈子都能记得清清楚楚，且无法原谅。 看别人生活时，我们总喜欢放大他们的幸福，忽略他们生活中的不幸，所以别人的生活怎么看都觉得幸福。而在看待自己的生活时，人们总喜欢缩小自己的幸福，扩大自己的烦恼，所以我们对自己的生活总有太多的不满。 当别人在公众场所不小心出丑时，我们往往一笑了之；而当同样的情境在自己身上出现时，我们往往好长时间不能从尴尬中走出来。 看到别人取得成功时，我们会说，他们的运气好；当他们遭遇失败时，我们会说，他们不努力。自己取得成功时，我们会说这是自己努力的结果；若遭遇失败，我们会自我解嘲说都是环境的错。 看别人谈恋爱挑肥拣瘦，我们暗说，不知自己长啥样，还在那儿挑挑拣拣。轮到自己谈恋爱时，总觉得没人能配得上自己。 谁能永远顺利？人生的耻辱不在于输，而在于输不起；人生的光荣不在于永不仆到，而在于能屡仆屡起。 思虑过少，可能失去做人的尊严；思虑过多，就会失去做人的乐趣。 若能得而无愧疚，失而无怨悔，得失的结果，就由它去吧。 光线强的地方，影子也比较黑。 不要说自己有多好，别人一般不会相信；不要说自己有多坏，别人一般会相信的。 不要在意别人对你的尖刻评论，学会超脱。 不急于求回报，把帮助他人而得到的欣慰作为最好的回报。 体贴他人的感情。嘲笑，必得不偿失，还可能造成意料不到的伤害。 为了控制执著，必须观照好感觉的大门。 每个人都有潜在的能量，只是很容易：被习惯所掩盖，被时间所迷离，被惰性所消磨。 爱人就像粗布衣，虽然不美丽，可是能遮挡风寒。情人就像时装，感觉很美好，却不能穿出去。亲人就像老棉衣，就是出痱子，依然要捂着你。友人就像晴雨衣，需要了就穿，用过后放一边。 人最聪明的，并不是捡起了别人还没捡到的东西，而是别人捡到了你不想捡的东西。 创造机会的人是勇者。等待机会的人是愚者。 忍耐是坚忍和能耐的简称。 使人疲惫的不是远方的高山，而是鞋里的一粒沙子。 人最悲哀的，并不是昨天失去得太多，而是沉浸于昨天的悲哀之中。 昨天是一张废弃了的支票，明天是一笔尚未到期的存款，只有今天是你可以支配的现金。 人人都讲理时有理可走遍天下，人人不讲理时有理将寸步难行。 阳光虽然暖和，可照射的时间长了，也会遭到谩骂。 乐观的人只顾著笑，而忘了怨；悲观的人只顾著怨，而忘了笑。 如果成功方向是错误的，坚持到底就会错误到底。 你有权发怒，但不应践踏别人的尊严；你有权失败，但不应自暴自弃；你有权争取成功，但不应以牺牲他人为代价；你有权要求争议，但不应以复仇为手段。你有权要求生活得更美好，但不应以今天的欺骗来捡取明天的快乐。 人要有着眼点；又要有落脚点。前者是战略；后者是战术。 世界上最永恒的幸福就是平凡，人生中最长久的拥有就是珍惜。 不要贪图无所不有，否则你将一无所有；不要试图无所不知，否则你将一无所知；不要企图无所不能，否则你将一无所能。 社会就像鱼塘，虽然泥沙俱下，可要真是清水一潭也有点可怕。家庭就像鱼缸，需要清洗，需要换气，需要精心护理，不然就生存不下去。 面对失败和挫折一笑而过，是一种乐观自信；面对误解和仇恨一笑而过，是一种坦然宽容；面对赞扬和激励一笑而过，是一种谦虚清醒；面对烦恼和忧愁一笑而过，是一种平和释然。 世上只有想不通的人，没有走不通的路。没有走不到顶的山，只有找不到路的人。 放弃该放弃是无奈，放弃不该放弃的是无能；不放弃该放弃的是无知，不放弃不该放弃的是执着。 世上没有绝望的处境，只有对处境绝望的人。","link":"","permalink":"http://www.jianwu925.com/2018/08/28/彷徨时瞅一眼/","excerpt":"引导语：人生路上不如意十常八九，遇到挫折时常常情绪低落，所以，当你举棋不定时，不防问问自己，这么做，将来会后悔吗？用今天的努力让明天没有遗憾!人生格言:思路决定出路,人生在于奋斗。 成功的人，就是那种能用别人扔向他的石头来铺设路基的人。 批评你的人是你今天的敌人，明天的朋友；吹捧你的人是你今天的朋友，明天的敌人。 Nothing is impossible、只要选择了目标，不要再想太远，每天脚踏实地，风雨兼程。生命不息，战斗不止。 你和你的朋友会一起在将来打造一个可能很辉煌的事业。很好听是吗？记住，你们都要努力。 很多事情当你再回忆时会发现其实没什么。所以，不管当时你多么生气都告诉自己不必这样，你会发现其实真的不必。","tags":[{"name":"Note","slug":"Note","permalink":"http://www.jianwu925.com/tags/Note/"}]},{"title":"Python3代码记事本","date":"2018-08-28T13:00:09.000Z","path":"2018/08/28/Python3代码记事本/","text":"Python打包压缩文件夹 根据变量Object获取名字的字符串 判断一个字符串是不是一个数字 Python中类似于log4j的日志输出 Python打包压缩文件夹def make_zip(source_dir, output_filename): #打包目录为zip文件（未压缩） zipf = zipfile.ZipFile(output_filename, &apos;a&apos;) pre_len = len(os.path.dirname(source_dir)) for parent, dirnames, filenames in os.walk(source_dir): for filename in filenames: pathfile = os.path.join(parent, filename) arcname = pathfile[pre_len:].strip(os.path.sep) #相对路径 zipf.write(pathfile, arcname) zipf.close() 根据变量Object获取名字的字符串def get_name_of_obj(obj,globals, except_word=&quot;&quot;): for name, item in globals.items(): if item == obj and name != except_word: return name 判断一个字符串是不是一个数字# 判断一个字符串是不是数 def is_number(s): s=str(s) try: float(s) return True except ValueError: pass # 注释下方可以判断字符串是不是中文的数字，例如‘四’ # try: # import unicodedata # unicodedata.numeric(s) # return True # except (TypeError, ValueError): # pass return False Python中类似于log4j的日志输出参考：python日志公用文件设计-类似java的log4j %(levelno)s: 打印日志级别的数值 %(levelname)s: 打印日志级别名称&apos;NOTSET&apos;、&apos;DEBUG&apos;、&apos;INFO&apos;、&apos;WARNING&apos;、&apos;WARN&apos;、&apos;ERROR&apos;、&apos;FATAL&apos;、&apos;CRITICAL&apos; %(pathname)s: 打印当前执行程序的路径，其实就是sys.argv[0] %(filename)s: 打印当前执行程序名 %(funcName)s: 打印日志的当前函数 %(lineno)d: 打印日志的当前行号 %(asctime)s: 打印日志的时间 %(thread)d: 打印线程ID %(threadName)s: 打印线程名称 %(process)d: 打印进程ID %(message)s: 打印日志信息 %y 两位数的年份表示（00-99） %Y 四位数的年份表示（000-9999） %m 月份（01-12） %d 月内中的一天（0-31） %H 24小时制小时数（0-23） %I 12小时制小时数（01-12） %M 分钟数（00=59） %S 秒（00-59） %a 本地简化星期名称 %A 本地完整星期名称 %b 本地简化的月份名称 %B 本地完整的月份名称 %c 本地相应的日期表示和时间表示 %j 年内的一天（001-366） %p 本地A.M.或P.M.的等价符 %U 一年中的星期数（00-53）星期天为星期的开始 %w 星期（0-6），星期天为星期的开始 %W 一年中的星期数（00-53）星期一为星期的开始 %x 本地相应的日期表示 %X 本地相应的时间表示 %Z 当前时区的名称 %% %号本身 &quot;&quot;&quot; import logging import datetime def getLog(path=&apos;.&apos;): dt = datetime.datetime.now() dtstr = dt.strftime(&apos;%Y-%m-%d&apos;) # dtstr=dt.strftime(&apos;%Y-%m-%d_%H_%M_%S&apos;) # 创建一个logger实例 logger = logging.getLogger(&quot;mylogger&quot;) logging.basicConfig(filemode=&apos;wa&apos;) hds = logger.handlers for h in hds: logger.removeHandler(h) logger.setLevel(logging.INFO) # 创建一个handler,用于写入日志文件，handler可以把日志内容写到不同的地方 logName = &quot;%s/%s_temp.log&quot; % (path, dtstr) fh = logging.FileHandler(logName) fh.setLevel(logging.INFO) # 再创建一个handler，用于输出控制台 ch = logging.StreamHandler() ch.setLevel(logging.INFO) log_format = logging.Formatter(&quot;[%(asctime)s-%(filename)s:%(lineno)d]\\n%(levelname)s:%(message)s&quot;, datefmt=&apos;%y-%m-%d %H:%M:%S&apos;) fh.setFormatter(log_format) # setFormatter() selects a Formatter object for this handler to use ch.setFormatter(log_format) logger.addHandler(fh) logger.addHandler(ch) return logger","link":"","permalink":"http://www.jianwu925.com/2018/08/28/Python3代码记事本/","excerpt":"Python打包压缩文件夹 根据变量Object获取名字的字符串 判断一个字符串是不是一个数字 Python中类似于log4j的日志输出","tags":[{"name":"Programming","slug":"Programming","permalink":"http://www.jianwu925.com/tags/Programming/"}]},{"title":"计算机与生活","date":"2018-08-27T12:14:01.000Z","path":"2018/08/27/computer-life/","text":"不知道什么时候确立与计算机打交道，大一大二没有想过以后自己未来的职业方向，大三考研的时候才确立考计算机的研究生，自己慢慢的才走上计算机的道路上。时至今日，感觉自己在IT和程序员的道路上越走越远，说不上特别喜欢，内心一直崇拜位置和神奇的事物，在我看来编程开发软件，写几行命令就可以实现很多意想不到的功能，这看起来确实在神奇不过了。这也算是比较喜欢干的事吧，好好干吧，相信自己。","link":"","permalink":"http://www.jianwu925.com/2018/08/27/computer-life/","excerpt":"","tags":[{"name":"Note","slug":"Note","permalink":"http://www.jianwu925.com/tags/Note/"}]},{"title":"Hello World","date":"2018-08-27T11:38:28.258Z","path":"2018/08/27/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"","permalink":"http://www.jianwu925.com/2018/08/27/hello-world/","excerpt":"","tags":[{"name":"Note","slug":"Note","permalink":"http://www.jianwu925.com/tags/Note/"}]}]